README.org
***** CIE LCH Extractor

The CIE LCH extractor is identical to the HSL extractor.

#+BEGIN_SRC deno :tangle "./src/internals/color/format/lch.js" :comments link
/** Extract: CIE LCH values */
export const extract = (lch) => lch.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
#+END_SRC

Now, I'll set up some extraction tests.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const lch = await import(`${Deno.cwd()}/src/internals/color/format/lch.js`);

<<valid-lch>>

console.log("const colors =", colors.map(({ color }) => ({ color, values: lch.extract(color) })));
#+END_SRC

#+NAME: extracted-lch
#+begin_src deno
const colors = [
  { color: "lch(0% 0 0)", values: [ "0%", "0", "0" ] },
  { color: "lch(50% 0 0)", values: [ "50%", "0", "0" ] },
  { color: "lch(100% 0 0)", values: [ "100%", "0", "0" ] },
  { color: "lch(50% 230 0)", values: [ "50%", "230", "0" ] },
  { color: "lch(29.2345% 44.2 27)", values: [ "29.2345%", "44.2", "27" ] },
  { color: "lch(52.2345% 72.2 56.2)", values: [ "52.2345%", "72.2", "56.2" ] },
  { color: "lch(60.3119% 34.3 139.3)", values: [ "60.3119%", "34.3", "139.3" ] },
  { color: "lch(39.119% 58.1 258.9)", values: [ "39.119%", "58.1", "258.9" ] },
  {
    color: "lch(79.44% 119 320.89 / 0.7)",
    values: [ "79.44%", "119", "320.89", "0.7" ]
  },
  {
    color: "lch(62.1183% 42.5 81.881 / 89%)",
    values: [ "62.1183%", "42.5", "81.881", "89%" ]
  },
  { color: "lch(119.339% 39.9 130deg)", values: [ "119.339%", "39.9", "130deg" ] },
  { color: "lch(93.411% 74.42 200rad)", values: [ "93.411%", "74.42", "200rad" ] },
  { color: "lch(33% 38.4434 3grad)", values: [ "33%", "38.4434", "3grad" ] },
  {
    color: "lch(71.831% 204.314 0.184turn / 0.98)",
    values: [ "71.831%", "204.314", "0.184turn", "0.98" ]
  }
]
#+end_src

And that's it. Full support for validating and extracting the values of all current (and future) CSS
color formats. Not very useful  by itself, so I'm going to write functionality to convert between them.

*** Conversion (=src/internals/color/convert/index.js=)

The internal color conversion functions are organized by format. They follow a convention of
=inputFormat.outputFormat(color)= this allows them to easily be composed in a logical order to create
the higher level color conversion utilities exposed in the public API.

Each implementation assumes extracted color values instead of a full color. This is to ensure color
formatting functions remain separate from conversion functions for the reasons demonstrated in the API.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/index.js" :comments link
/** Internal color conversion utilities */
export * as hex from "./hex.js";
export * as named from "./named.js";
export * as rgb from "./rgb.js";
export * as hsl from "./hsl.js";
export * as cmyk from "./device-cmyk.js";
export * as hwb from "./hwb.js";
export * as lab from "./lab.js";
export * as lch from "./lch.js";
#+END_SRC

**** Setup (=src/internals/color/convert/setup.js=)

Before I write color conversion functions, I need some helpers to streamline the process.

***** Hex RGB Fragments

As I wrote earlier, I consider hex colors on the web color primitives. They're the starting point
of all conversions because hex colors can only be directly converted to functional RGB which begins
the conversion chain for other formats.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/setup.js" :comments link
/** Helper for converting hex->int */
export const hexFragmentToChannel = (fragment) => parseInt(fragment, 16);

/** Helper for converting int->hex */
export const channelToHexFragment = (channel) =>
channel.toString(16).padStart(2, "0");
#+END_SRC

***** Math

Before I write the functions for actual conversion, I need to write some basic arithmetic helpers.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/setup.js" :comments link
/** Helper to set significant digits */
const significant = (digits, value) => +value.toPrecision(digits);

/** x + y */
const sum = (y, x) => significant(6, x + y);

/** x  y */
const product = (y, x) => significant(6, x * y);

/** x  y */
const quotient = (y, x) => significant(6, x / y);

/** x % y */
const remainder = (y, x) => significant(6, x % y);

// Hrad, Hgrad, Hturn -> hue

/** Formula: n = n  180 */
export const calcHueFromRad = (radians) =>
Math.round(product(quotient(Math.PI, 180), radians));

/** Formula: n = n 180200 */
export const calcHueFromGrad = (gradians) =>
Math.round(product(quotient(200, 180), gradians));

/** Formula: n = n%  360 */
export const calcHueFromTurn = (turn) => Math.round(product(360, turn));

// Hue correction

/** Formula: n = -n + 360 */
export const correctHueCounterClockwise = (hue) => sum(360, hue);

/** Formula: n = n % 360 */
export const correctHueClockwise = (hue) => remainder(360, hue);

// Saturation, lightness

/** Formula: n = n%100 */
export const calcFractionFromPercent = (percentage) =>
quotient(100, percentage);

/** Formula: n = n  100 */
export const calcPercentFromFraction = (fraction) => product(100, fraction);

// RGB calculations

/** Formula: n = n  255 */
export const calcChannelFromFraction = (fraction) => product(255, fraction);

/** Formula: n = n255 */
export const calcFractionFromChannel = (channel) => quotient(255, channel);

/** Formula: n = n%100  255 */
export const calcChannelFromPercent = (percentage) =>
Math.round(calcChannelFromFraction(calcFractionFromPercent(percentage)));

/** Normalization to define boundaries */
export const normalize = (a, x, b) => Math.round(Math.min(Math.max(x, a), b));

// Alpha

/** Helper to convert alpha value to hex fragment */
export const calcHexFragmentFromAlpha = (alpha) =>
channelToHexFragment(Math.round(calcChannelFromFraction(alpha)));

// Differential helper for color mixing

/** Calculate the differential between original and offset */
export const calcDifferential = (original, target, p) =>
significant(6, ((1 - p) * original ** 2 + p * target ** 2) ** 0.5);
#+END_SRC

Now, I'm ready to write the conversion algorithms.

**** RGB Hex Conversion (=src/internals/color/convert/hex.js=)

To reiterate, a hex color is the primitive color value. They may convert up to another format,
but cannot convert down to anything but machine code.

***** RGB Hex -> Functional RGB (=hex.rgb=)

Converting RGB Hex to functional RGB is a matter of extracting each channel hex fragment and
converting them to their equivalent integers. And then converting the alpha channel /if/ it exists.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/hex.js" :comments link
import { calcFractionFromChannel, hexFragmentToChannel } from "./setup.js";

/** RGB Hex -> Functional RGB */
export function rgb(hex) {
  const [r, g, b, alpha] = hex;
  const [R, G, B] = [r, g, b].map((fragment) => hexFragmentToChannel(fragment));
  const A = calcFractionFromChannel(hexFragmentToChannel(alpha ?? "ff"));

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

For testing my implementation, I'll reuse the extracted hex results above.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const hex = await import(`${Deno.cwd()}/src/internals/color/convert/hex.js`);

<<extracted-hex>>

console.log(colors.map(({color, values}) => ({hex: color, rgb: hex.rgb(values)})));
#+END_SRC

#+NAME: hex-to-rgb
#+begin_src deno
[
  { hex: "#000000", rgb: "rgb(0, 0, 0)" },
  { hex: "#ffffff", rgb: "rgb(255, 255, 255)" },
  { hex: "#000000", rgb: "rgb(0, 0, 0)" },
  { hex: "#ffffff", rgb: "rgb(255, 255, 255)" },
  { hex: "#aaccee", rgb: "rgb(170, 204, 238)" },
  { hex: "#bbeeaa", rgb: "rgb(187, 238, 170)" },
  { hex: "#ffeedd", rgb: "rgb(255, 238, 221)" },
  { hex: "#deaded", rgb: "rgb(222, 173, 237)" },
  { hex: "#bada55", rgb: "rgb(186, 218, 85)" },
  { hex: "#c0ffee", rgb: "rgb(192, 255, 238)" },
  { hex: "#caf3c0", rgb: "rgb(202, 243, 192)" },
  { hex: "#000000ff", rgb: "rgb(0, 0, 0)" },
  { hex: "#ffffffff", rgb: "rgb(255, 255, 255)" },
  { hex: "#ffaaccee", rgb: "rgba(255, 170, 204, 0.933333)" },
  { hex: "#ccaa5577", rgb: "rgba(204, 170, 85, 0.466667)" },
  { hex: "#000000ff", rgb: "rgb(0, 0, 0)" },
  { hex: "#ffffffff", rgb: "rgb(255, 255, 255)" },
  { hex: "#abcede79", rgb: "rgba(171, 206, 222, 0.47451)" },
  { hex: "#33a0c9c3", rgb: "rgba(51, 160, 201, 0.764706)" },
  { hex: "#eecc99dd", rgb: "rgba(238, 204, 153, 0.866667)" }
]
#+end_src

Success!

**** W3C-X11 Conversion (=src/internals/color/convert/named.js=)

***** RGB Hex <- W3C-X11

After validation, the only possible conversion for a CSS named color is a query for its hex value.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/named.js" :comments link
import { X11Colors } from "../../../data/color/w3c-x11.js";

/** RGB HEX <- W3C-X11 */
export const hex = (keyword) => X11Colors[keyword];
#+END_SRC

**** Functional RGB Conversion (=src/internals/color/convert/rgb.js=)

Functional RGB leads to the first progressive conversion fork and regression option.

+ =RGB Hex <- Functional RGB=: a regressive conversion to RGB Hex
+ =Functional RGB -> Functional HSL=: a progressive conversion to HSL
+ =Functional RGB -> Device CMYK=: a progressive conversion to CMYK
+ =Functional RGB -> Functional HWB=: a progressive conversion to HWB
+ =Functional RGB -> Functional CIE Lab=: a progressive conversion to Lab

***** RGB Conversion Setup

Functional RGB conversions are slightly more complex than RGB Hex conversions, so they require a bit
of extra math. Luckily, I defined those arithmetic helpers, so I'll pull in the necessary ones.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/rgb.js" :comments link
import {
  calcChannelFromPercent,
  calcFractionFromChannel,
  calcFractionFromPercent,
  calcHexFragmentFromAlpha,
  calcPercentFromFraction,
  channelToHexFragment,
  correctHueCounterClockwise,
} from "./setup.js";

/** A helper function to prep RGB values for calculations */
function parseRGB(rgb) {
  const [r, g, b, alpha] = rgb;
  const value = (s) => parseFloat(s);
  const [R, G, B] = [r, g, b].map((channel) =>
    channel.endsWith("%")
      ? calcChannelFromPercent(value(channel))
      : value(channel)
  );

  const a = value(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [R, G, B] : [R, G, B, A];
}
#+END_SRC

***** RGB Hex <- Functional RGB (=rgb.hex=)

A regressive conversion is one that breaks a color down. Since an RGB color begins the chain to
higher conversions, that leaves RGB Hex as the only possible regression.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/rgb.js" :comments link
/** RGB Hex <- Functional RGB */
export function hex(rgb) {
  const [r, g, b, alpha] = parseRGB(rgb);

  const [R, G, B] = [r, g, b].map((channel) => channelToHexFragment(channel));
  // Alpha is defined and not null
  const A = (alpha && calcHexFragmentFromAlpha(alpha ?? 1)) || "ff";

  return A === "ff" ? `#${R}${G}${B}` : `#${R}${G}${B}${A}`;
}
#+END_SRC

Now, I'll use the extracted RGB defined earlier to test my conversions for accuracy.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const rgb = await import(`${Deno.cwd()}/src/internals/color/convert/rgb.js`);

<<extracted-rgb>>

console.log(colors.map(({color, values}) => ({rgb: color, hex: rgb.hex(values)})));
#+END_SRC

#+rgb-to-hex
#+begin_src deno
[
  { rgb: "rgb(0, 0, 0)", hex: "#000000" },
  { rgb: "rgb(255, 255, 255)", hex: "#ffffff" },
  { rgb: "rgb(110, 22, 33)", hex: "#6e1621" },
  { rgb: "rgb(30, 220, 140)", hex: "#1edc8c" },
  { rgb: "rgb(148, 129, 240)", hex: "#9481f0" },
  { rgb: "rgb(31 33 100)", hex: "#1f2164" },
  { rgb: "rgb(200 210 131)", hex: "#c8d283" },
  { rgb: "rgb(0%, 0%, 0%)", hex: "#000000" },
  { rgb: "rgb(100%, 100%, 100%)", hex: "#ffffff" },
  { rgb: "rgb(31%, 15%, 4%)", hex: "#4f260a" },
  { rgb: "rgb(20%, 70.3%, 49%)", hex: "#33b37d" },
  { rgb: "rgb(10% 30% 95%)", hex: "#1a4df2" },
  { rgb: "rgb(33% 24% 44%)", hex: "#543d70" },
  { rgb: "rgba(0, 0, 0, 1)", hex: "#000000" },
  { rgb: "rgba(255, 255, 255, 1)", hex: "#ffffff" },
  { rgb: "rgba(230, 110, 0, 0.8)", hex: "#e66e00cc" },
  { rgb: "rgba(120, 178, 34, 0.719)", hex: "#78b222b7" },
  { rgb: "rgba(34, 199, 249, 0.3)", hex: "#22c7f94d" },
  { rgb: "rgb(10 110 200 / 73%)", hex: "#0a6ec8ba" },
  { rgb: "rgba(34 225 110 / 25.9%)", hex: "#22e16e42" },
  { rgb: "rgb(10% 33% 19% / 0.35)", hex: "#1a543059" }
]
#+end_src

