README.org
***** Functional RGB <- Functional HSL (=hsl.rgb=)

The only unique HSL conversion is a regressive conversion to RGB which can be used as a jumping off
point for converting to all remaining formats.

First, the extracted values require some prepping before calculations are predictable.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/hsl.js" :comments link
import {
  calcChannelFromFraction,
  calcFractionFromPercent,
  calcHueFromGrad,
  calcHueFromRad,
  calcHueFromTurn,
  correctHueClockwise,
  correctHueCounterClockwise,
} from "./setup.js";

// https://www.rapidtables.com/convert/color/hsl-to-rgb.html
const calcChannels = (C, X, H) =>
  new Map([
    [[C, X, 0], 0 <= H && H < 60],
    [[X, C, 0], 60 <= H && H < 120],
    [[0, C, X], 120 <= H && H < 180],
    [[0, X, C], 180 <= H && H < 240],
    [[X, 0, C], 240 <= H && H < 300],
    [[C, 0, X], 300 <= H && H < 360],
  ]);

export const parseHSL = (hsl) => {
  const [h, s, l, alpha] = hsl;

  const [H] = [h].map((value) => {
    const n = parseFloat(value);
    const isNegative = (n) => Math.sign(n) === -1;
    let hue;

    // Set hue based on unit
    if (value.endsWith("grad")) {
      hue = isNegative(n) ? calcHueFromGrad(n + 400) : calcHueFromGrad(n);
    } else if (value.endsWith("rad")) {
      hue = isNegative(n) ? calcHueFromRad(n + 6.28319) : calcHueFromRad(n);
    } else if (value.endsWith("turn")) {
      hue = isNegative(n) ? calcHueFromTurn(n + 1) : calcHueFromTurn(n);
    } else {
      hue = n;
    }

    // hue correction
    let degrees;
    if (hue >= 360) {
      degrees = correctHueClockwise(hue);
    } else if (isNegative(hue)) {
      degrees = correctHueClockwise(correctHueCounterClockwise(hue));
    } else {
      degrees = hue;
    }

    return degrees;
  });

  const [S, L] = [s, l].map((value) => {
    const n = parseFloat(value);
    return calcFractionFromPercent(n);
  });

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, S, L] : [H, S, L, A];
};

export const calcRGB = (h, s, l) => {
  // Calculate chroma
  const C = (1 - Math.abs(2 * l - 1)) * s;
  const X = C * (1 - Math.abs(((h / 60) % 2) - 1));
  const m = l - C / 2;

  // Evaluate channels
  const [R, G, B] = Array.from(calcChannels(C, X, h))
    .filter(([, condition]) => condition)
    .flatMap(([evaluation]) => evaluation)
    .map((channel) => Math.round(calcChannelFromFraction(channel + m)));

  return [R, G, B];
};
#+END_SRC

Phew. Now for the actual conversion algorithm, it's a similar pattern to the RGB progressive
conversion to HSL.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/hsl.js" :comments link
/** Functional RGB <- Functional HSL */
export function rgb(hsl) {
  const [h, s, l, alpha] = parseHSL(hsl);
  const [R, G, B] = calcRGB(h, s, l);

  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Now, the tests with my extracted HSL to verify that the math checks out.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const hsl = await import(`${Deno.cwd()}/src/internals/color/convert/hsl.js`);

<<extracted-hsl>>

console.log(colors.map(({color, values}) => ({hsl: color, rgb: hsl.rgb(values)})));
#+END_SRC

#+NAME: hsl-to-rgb
#+begin_src deno
[
  { hsl: "hsl(0, 0%, 0%)", rgb: "rgb(0, 0, 0)" },
  { hsl: "hsl(0, 0%, 50%)", rgb: "rgb(128, 128, 128)" },
  { hsl: "hsl(0, 0%, 100%)", rgb: "rgb(255, 255, 255)" },
  { hsl: "hsl(0 0% 0%)", rgb: "rgb(0, 0, 0)" },
  { hsl: "hsl(0 0% 50%)", rgb: "rgb(128, 128, 128)" },
  { hsl: "hsl(0 0% 100%)", rgb: "rgb(255, 255, 255)" },
  { hsl: "hsl(120, 74%, 63%)", rgb: "rgb(91, 230, 91)" },
  { hsl: "hsl(64deg, 85%, 50%)", rgb: "rgb(221, 236, 19)" },
  { hsl: "hsl(200rad, 42%, 81%)", rgb: "rgb(226, 186, 227)" },
  { hsl: "hsl(2.3grad, 50%, 50%)", rgb: "rgb(191, 68, 64)" },
  { hsl: "hsl(0.25turn, 39%, 73%)", rgb: "rgb(186, 213, 159)" },
  { hsl: "hsl(-135, 69%, 94%)", rgb: "rgb(229, 234, 250)" },
  { hsl: "hsl(189 35% 82%)", rgb: "rgb(193, 220, 225)" },
  { hsl: "hsl(161deg 50% 78%)", rgb: "rgb(171, 227, 209)" },
  { hsl: "hsl(380rad 75% 13%)", rgb: "rgb(8, 58, 51)" },
  { hsl: "hsl(1.6grad 100% 48%)", rgb: "rgb(245, 4, 0)" },
  { hsl: "hsl(0.13turn 58% 20%)", rgb: "rgb(81, 68, 21)" },
  { hsl: "hsl(-1.9grad 33% 80%)", rgb: "rgb(221, 187, 188)" },
  { hsl: "hsla(0, 0%, 0%, 1)", rgb: "rgb(0, 0, 0)" },
  { hsl: "hsla(0, 0%, 50%, 1)", rgb: "rgb(128, 128, 128)" },
  { hsl: "hsla(0, 0%, 100%, 1)", rgb: "rgb(255, 255, 255)" },
  { hsl: "hsla(0 0% 0% / 1)", rgb: "rgb(0, 0, 0)" },
  { hsl: "hsla(0 0% 50% / 1)", rgb: "rgb(128, 128, 128)" },
  { hsl: "hsla(0 0% 100% / 1)", rgb: "rgb(255, 255, 255)" },
  { hsl: "hsla(34, 73%, 89%, 0.7)", rgb: "rgba(247, 230, 206, 0.7)" },
  { hsl: "hsla(67deg, 99%, 38%, 0.25)", rgb: "rgba(170, 193, 1, 0.25)" },
  { hsl: "hsla(393rad, 85%, 18%, 0.493)", rgb: "rgba(7, 63, 85, 0.493)" },
  { hsl: "hsla(5.2grad, 39%, 58%, 0.5)", rgb: "rgba(190, 113, 106, 0.5)" },
  { hsl: "hsla(0.34turn, 19%, 36%, 0.39)", rgb: "rgba(74, 109, 76, 0.39)" },
  { hsl: "hsl(100 40% 39% / 73%)", rgb: "rgba(86, 139, 60, 0.73)" },
  { hsl: "hsl(90deg 89% 61% / 0.3)", rgb: "rgba(156, 244, 67, 0.3)" },
  { hsl: "hsla(48rad 74% 38% / 39%)", rgb: "rgba(25, 49, 169, 0.39)" },
  { hsl: "hsl(4.8grad 37% 100% / 0.47)", rgb: "rgba(255, 255, 255, 0.47)" },
  { hsl: "hsla(0.134turn 33% 88% / 40%)", rgb: "rgba(234, 230, 214, 0.4)" }
]
#+end_src

**** Device CMYK Conversion (=src/internals/color/convert/device-cmyk.js=)

CMYK  conversion is like HSL in that it's more of an endpoint and needs to be regressively converted
to functional RGB before it can be included in a conversion chain.

***** Functional RGB <- Device CMYK (=cmyk.rgb=)

First, some minimal setup.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/device-cmyk.js" :comments link
import { calcChannelFromFraction, calcFractionFromPercent } from "./setup.js";

function parseCMYK(cmyk) {
  const [c, m, y, k, alpha] = cmyk;
  const value = (s) => parseFloat(s);
  const [C, M, Y, K] = [c, m, y, k].map((component) =>
    component.endsWith("%")
      ? calcFractionFromPercent(value(component))
      : value(component)
  );

  const a = value(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [C, M, Y, K] : [C, M, Y, K, A];
}
#+END_SRC

For the conversion algorithm, it's RapidTables coming again with the assist.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/device-cmyk.js" :comments link
/** Functional RGB <- Device CMYK */
export function rgb(cmyk) {
  const [C, M, Y, K, alpha] = parseCMYK(cmyk);

  const [R, G, B] = [C, M, Y].map((component) =>
    Math.round(calcChannelFromFraction(1 - component * (1 - K)))
  );
  const A = (alpha && (alpha ?? 1)) || 1;

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Time to see if the math stacks up.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const cmyk = await import(`${Deno.cwd()}/src/internals/color/convert/device-cmyk.js`);

<<extracted-cmyk>>

console.log(colors.map(({color, values}) => ({cmyk: color, rgb: cmyk.rgb(values)})));
#+END_SRC

#+NAME: cmyk-to-rgb
#+begin_src deno
[
  { cmyk: "device-cmyk(0 0 0 0)", rgb: "rgb(255, 255, 255)" },
  { cmyk: "device-cmyk(1 0 0 0)", rgb: "rgb(0, 255, 255)" },
  { cmyk: "device-cmyk(0 1 0 0)", rgb: "rgb(255, 0, 255)" },
  { cmyk: "device-cmyk(0 0 1 0)", rgb: "rgb(255, 255, 0)" },
  { cmyk: "device-cmyk(0 0 0 1)", rgb: "rgb(255, 255, 255)" },
  { cmyk: "device-cmyk(1 1 1 0)", rgb: "rgb(0, 0, 0)" },
  { cmyk: "device-cmyk(0% 0% 0% 0%)", rgb: "rgb(255, 255, 255)" },
  { cmyk: "device-cmyk(100% 0% 0% 0%)", rgb: "rgb(0, 255, 255)" },
  { cmyk: "device-cmyk(0% 100% 0% 0%)", rgb: "rgb(255, 0, 255)" },
  { cmyk: "device-cmyk(0% 0% 100% 0%)", rgb: "rgb(255, 255, 0)" },
  { cmyk: "device-cmyk(0% 0% 0% 100%)", rgb: "rgb(255, 255, 255)" },
  { cmyk: "device-cmyk(100% 100% 100% 0%)", rgb: "rgb(0, 0, 0)" },
  { cmyk: "device-cmyk(0 0.4 0.8 0.25)", rgb: "rgb(255, 179, 102)" },
  { cmyk: "device-cmyk(30% 49% 0 20%)", rgb: "rgb(194, 155, 255)" },
  { cmyk: "device-cmyk(19% 30% 83% 0 / 0.31)", rgb: "rgba(207, 179, 43, 0.31)" },
  { cmyk: "device-cmyk(0.9 0.25 0 0 / 73%)", rgb: "rgba(26, 191, 255, 0.73)" }
]
#+end_src

**** Functional HWB Conversion (=src/internals/color/convert/hwb.js=)

The only possible conversion from HWB is a regressive conversion to RGB. This provides the necessary
bridge to other format conversions.

***** Functional RGB <- Functional HWB

As with the progressive conversion, the regressive conversion is a composite. It first splits the
hue with a call to =calcRGB()= from the HSL conversion module, setting the saturation and lightness to
return a pure hue, then modifies the result with the given amount of white and black.

Again, the implementation uses [[https://www.w3.org/TR/css-color-4/#hwb-to-rgb][a formula ripped straight from the spec]] with some modifications.

First, setting up some helpers:

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/hwb.js" :comments link
import {
  calcChannelFromFraction,
  calcFractionFromChannel,
  calcFractionFromPercent,
} from "./setup.js";
import { calcRGB, parseHSL } from "./hsl.js";

function parseHWB(hwb) {
  const [h, w, blk, alpha] = hwb;
  const [H] = parseHSL([h, "100%", "50%", "1"]);
  const [W, BLK] = [w, blk].map((component) =>
    calcFractionFromPercent(parseFloat(component))
  );

  const a = parseFloat(alpha);
  const A = a != null ? (a > 1 ? calcFractionFromPercent(a) : a) : 1;

  return A === 1 ? [H, W, BLK] : [H, W, BLK, A];
}
#+END_SRC

And now for the conversion algorithm.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/hwb.js" :comments link
/** Functional RGB <- Functional HWB */
export function rgb(hwb) {
  const [h, w, blk, alpha] = parseHWB(hwb);
  const [r, g, b] = calcRGB(h, 1, 0.5);

  const A = (alpha && (alpha ?? 1)) || 1;

  // Achromatic
  if (w + blk >= 1) {
    const GRAY = Math.round(calcChannelFromFraction(w / (w + blk)));
    return A === 1
      ? `rgb(${GRAY}, ${GRAY}, ${GRAY})`
      : `rgba(${GRAY}, ${GRAY}, ${GRAY}, ${A})`;
  }

  const [R, G, B] = [r, g, b].map((channel) =>
    Math.round(
      calcChannelFromFraction(
        calcFractionFromChannel(channel) * (1 - w - blk) + w,
      ),
    )
  );

  return A === 1 ? `rgb(${R}, ${G}, ${B})` : `rgba(${R}, ${G}, ${B}, ${A})`;
}
#+END_SRC

Now the fun part: seeing if anything breaks.

#+BEGIN_SRC deno :results output code replace :allow read :noweb yes
const hwb = await import(`${Deno.cwd()}/src/internals/color/convert/hwb.js`);

<<extracted-hwb>>

console.log(colors.map(({color, values}) => ({hwb: color, rgb: hwb.rgb(values)})));
#+END_SRC

#+RESULTS:
#+begin_src deno
[
  { hwb: "hwb(0 100% 0%)", rgb: "rgb(255, 255, 255)" },
  { hwb: "hwb(0 0% 100%)", rgb: "rgb(0, 0, 0)" },
  { hwb: "hwb(0 100% 100%)", rgb: "rgb(128, 128, 128)" },
  { hwb: "hwb(47 37% 40%)", rgb: "rgb(153, 140, 94)" },
  { hwb: "hwb(180deg 50% 3%)", rgb: "rgb(128, 247, 247)" },
  { hwb: "hwb(172rad 25% 15%)", rgb: "rgb(64, 217, 102)" },
  { hwb: "hwb(3.1grad 0% 30%)", rgb: "rgb(179, 9, 0)" },
  { hwb: "hwb(0.28turn 49% 10%)", rgb: "rgb(158, 230, 125)" },
  { hwb: "hwb(310 78% 0% / 0.5)", rgb: "rgba(255, 199, 246, 0.5)" },
  { hwb: "hwb(89rad 10% 90% / 83%)", rgb: "rgba(26, 26, 26, 0.83)" }
]
#+end_src

Looks like we're golden.

**** Functional CIE Lab Conversion (=src/internals/color/convert/lab.js=)

CIE Lab requires a regressive conversion to Functional RGB. With this, the link is complete and CIE
Lab colors now have a bridge to other conversions.

***** CIE Lab Conversion Setup

I'll have to grab the RGB channel conversion function from my math kit.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/lab.js" :comments link
import {
  calcChannelFromFraction,
  calcFractionFromPercent,
  calcHueFromRad,
  correctHueCounterClockwise,
  normalize,
} from "./setup.js";
#+END_SRC

***** Functional RGB <- CIE Lab

Now, I follow an inversion of the progressive conversion algorithm.

1) =CIE XYZ <- Functional CIE Lab=
2) =Linear RGB <- CIE XYZ=
3) =Linear RGB >-< Functional RGB=

****** CIE XYZ <- Functonal CIE Lab

The [[http://www.brucelindbloom.com/index.html?Equations.html][formula for regressing CIE Lab to CIE XYZ]] is cleanly outlined. So, I'll follow that.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/lab.js" :comments link
function calcXYZ(lab) {
  const [L, a, b] = lab.map((v) => parseFloat(v));

  // CIE standards
  const  = 216 / 24389;
  const  = 24389 / 27;
  const white = [0.96422, 1.0, 0.82521]; // D50 reference white

  // Compute the values of F
  const Fy = (L + 16) / 116;
  const Fx = a / 500 + Fy;
  const Fz = Fy - b / 200;

  // Calculate xyz
  const [x, y, z] = [
    Fx ** 3 >  ? Fx ** 3 : (116 * Fx - 16) / ,
    L >  *  ? ((L + 16) / 116) ** 3 : L / ,
    Fz ** 3 >  ? Fz ** 3 : (116 * Fz - 16) / ,
  ];

  return [x, y, z].map((V, i) => V * white[i]);
}
#+END_SRC

****** Linear RGB <- CIE XYZ

The next step is converting the D50 XYZ to sRGB native D65 XYZ via chromatic adaptation.

And /then/ passing it through the inverse transformation matrix to get linear RGB.

#+BEGIN_SRC deno :tangle "./src/internals/color/convert/lab.js" :comments link
function calcLinearRGB(lab) {
  const [x, y, z] = calcXYZ(lab);
  /**
   * D65 transformation matrix
   * =============================
   * 0.9555766 -0.0230393  0.0631636
   * -0.0282895  1.0099416  0.0210077
   * 0.0122982 -0.0204830  1.3299098
   * =============================
   */
  const [X, Y, Z] = [
    x * 0.9555766 + y * -0.0230393 + z * 0.0631636,
    x * -0.0282895 + y * 1.0099416 + z * 0.0210077,
    x * 0.0122982 + y * -0.020483 + z * 1.3299098,
  ];

  /**
   * linear sRGB transformation matrix (inverse)
   * =============================
   *  3.2404542 -1.5371385 -0.4985314
   * -0.9692660  1.8760108  0.0415560
   *  0.0556434 -0.2040259  1.0572252
   * =============================
   */
  return [
    X * 3.2404542 + Y * -1.5371385 + Z * -0.4985314,
    X * -0.969266 + Y * 1.8760108 + Z * 0.041556,
    X * 0.0556434 + Y * -0.2040259 + Z * 1.0572252,
  ];
}
#+END_SRC

